spec/cassettes/Visitor_signs_up_and_makes_a_payment/with_valid_user_info_and_invalid_payment_info.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=999&currency=usd&card=tok_29QxcW6BdzVrhw
    headers:
      Accept:
      - ! '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.3
      Authorization:
      - Bearer sk_test_YV1EUbqpz4DkpQWUBCFkUkAH
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.8.3","lang":"ruby","lang_version":"1.9.3 p194 (2012-04-20)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        mont4 12.3.0 Darwin Kernel Version 12.3.0: Sun Jan  6 22:37:10 PST 2013; root:xnu-2050.22.13~1/RELEASE_X86_64
        x86_64"}'
      Content-Length:
      - '47'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Sun, 07 Jul 2013 02:39:53 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '152'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
    body:
      encoding: US-ASCII
      string: ! "{\n  \"error\": {\n    \"message\": \"Your card was declined.\",\n
        \   \"type\": \"card_error\",\n    \"code\": \"card_declined\",\n    \"charge\":
        \"ch_29QxHSTdE7G2yz\"\n  }\n}\n"
    http_version: 
  recorded_at: Sun, 07 Jul 2013 02:39:54 GMT
recorded_with: VCR 2.5.0
